; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l7-t1-p7---int100n150-m25---int100c110---s141---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 - fuellevel
)

(:init
(sum level0 level3 level3)
(sum level0 level5 level5)
(sum level0 level7 level7)
(sum level0 level8 level8)
(sum level0 level11 level11)
(sum level0 level19 level19)
(sum level0 level20 level20)
(sum level0 level22 level22)
(sum level1 level3 level4)
(sum level1 level5 level6)
(sum level1 level7 level8)
(sum level1 level8 level9)
(sum level1 level11 level12)
(sum level1 level19 level20)
(sum level1 level20 level21)
(sum level1 level22 level23)
(sum level2 level3 level5)
(sum level2 level5 level7)
(sum level2 level7 level9)
(sum level2 level8 level10)
(sum level2 level11 level13)
(sum level2 level19 level21)
(sum level2 level20 level22)
(sum level2 level22 level24)
(sum level3 level3 level6)
(sum level3 level5 level8)
(sum level3 level7 level10)
(sum level3 level8 level11)
(sum level3 level11 level14)
(sum level3 level19 level22)
(sum level3 level20 level23)
(sum level3 level22 level25)
(sum level4 level3 level7)
(sum level4 level5 level9)
(sum level4 level7 level11)
(sum level4 level8 level12)
(sum level4 level11 level15)
(sum level4 level19 level23)
(sum level4 level20 level24)
(sum level4 level22 level26)
(sum level5 level3 level8)
(sum level5 level5 level10)
(sum level5 level7 level12)
(sum level5 level8 level13)
(sum level5 level11 level16)
(sum level5 level19 level24)
(sum level5 level20 level25)
(sum level5 level22 level27)
(sum level6 level3 level9)
(sum level6 level5 level11)
(sum level6 level7 level13)
(sum level6 level8 level14)
(sum level6 level11 level17)
(sum level6 level19 level25)
(sum level6 level20 level26)
(sum level6 level22 level28)
(sum level7 level3 level10)
(sum level7 level5 level12)
(sum level7 level7 level14)
(sum level7 level8 level15)
(sum level7 level11 level18)
(sum level7 level19 level26)
(sum level7 level20 level27)
(sum level7 level22 level29)
(sum level8 level3 level11)
(sum level8 level5 level13)
(sum level8 level7 level15)
(sum level8 level8 level16)
(sum level8 level11 level19)
(sum level8 level19 level27)
(sum level8 level20 level28)
(sum level8 level22 level30)
(sum level9 level3 level12)
(sum level9 level5 level14)
(sum level9 level7 level16)
(sum level9 level8 level17)
(sum level9 level11 level20)
(sum level9 level19 level28)
(sum level9 level20 level29)
(sum level9 level22 level31)
(sum level10 level3 level13)
(sum level10 level5 level15)
(sum level10 level7 level17)
(sum level10 level8 level18)
(sum level10 level11 level21)
(sum level10 level19 level29)
(sum level10 level20 level30)
(sum level10 level22 level32)
(sum level11 level3 level14)
(sum level11 level5 level16)
(sum level11 level7 level18)
(sum level11 level8 level19)
(sum level11 level11 level22)
(sum level11 level19 level30)
(sum level11 level20 level31)
(sum level11 level22 level33)
(sum level12 level3 level15)
(sum level12 level5 level17)
(sum level12 level7 level19)
(sum level12 level8 level20)
(sum level12 level11 level23)
(sum level12 level19 level31)
(sum level12 level20 level32)
(sum level12 level22 level34)
(sum level13 level3 level16)
(sum level13 level5 level18)
(sum level13 level7 level20)
(sum level13 level8 level21)
(sum level13 level11 level24)
(sum level13 level19 level32)
(sum level13 level20 level33)
(sum level13 level22 level35)
(sum level14 level3 level17)
(sum level14 level5 level19)
(sum level14 level7 level21)
(sum level14 level8 level22)
(sum level14 level11 level25)
(sum level14 level19 level33)
(sum level14 level20 level34)
(sum level14 level22 level36)
(sum level15 level3 level18)
(sum level15 level5 level20)
(sum level15 level7 level22)
(sum level15 level8 level23)
(sum level15 level11 level26)
(sum level15 level19 level34)
(sum level15 level20 level35)
(sum level15 level22 level37)
(sum level16 level3 level19)
(sum level16 level5 level21)
(sum level16 level7 level23)
(sum level16 level8 level24)
(sum level16 level11 level27)
(sum level16 level19 level35)
(sum level16 level20 level36)
(sum level16 level22 level38)
(sum level17 level3 level20)
(sum level17 level5 level22)
(sum level17 level7 level24)
(sum level17 level8 level25)
(sum level17 level11 level28)
(sum level17 level19 level36)
(sum level17 level20 level37)
(sum level17 level22 level39)
(sum level18 level3 level21)
(sum level18 level5 level23)
(sum level18 level7 level25)
(sum level18 level8 level26)
(sum level18 level11 level29)
(sum level18 level19 level37)
(sum level18 level20 level38)
(sum level18 level22 level40)
(sum level19 level3 level22)
(sum level19 level5 level24)
(sum level19 level7 level26)
(sum level19 level8 level27)
(sum level19 level11 level30)
(sum level19 level19 level38)
(sum level19 level20 level39)
(sum level19 level22 level41)
(sum level20 level3 level23)
(sum level20 level5 level25)
(sum level20 level7 level27)
(sum level20 level8 level28)
(sum level20 level11 level31)
(sum level20 level19 level39)
(sum level20 level20 level40)
(sum level20 level22 level42)
(sum level21 level3 level24)
(sum level21 level5 level26)
(sum level21 level7 level28)
(sum level21 level8 level29)
(sum level21 level11 level32)
(sum level21 level19 level40)
(sum level21 level20 level41)
(sum level21 level22 level43)
(sum level22 level3 level25)
(sum level22 level5 level27)
(sum level22 level7 level29)
(sum level22 level8 level30)
(sum level22 level11 level33)
(sum level22 level19 level41)
(sum level22 level20 level42)
(sum level22 level22 level44)
(sum level23 level3 level26)
(sum level23 level5 level28)
(sum level23 level7 level30)
(sum level23 level8 level31)
(sum level23 level11 level34)
(sum level23 level19 level42)
(sum level23 level20 level43)
(sum level23 level22 level45)
(sum level24 level3 level27)
(sum level24 level5 level29)
(sum level24 level7 level31)
(sum level24 level8 level32)
(sum level24 level11 level35)
(sum level24 level19 level43)
(sum level24 level20 level44)
(sum level24 level22 level46)
(sum level25 level3 level28)
(sum level25 level5 level30)
(sum level25 level7 level32)
(sum level25 level8 level33)
(sum level25 level11 level36)
(sum level25 level19 level44)
(sum level25 level20 level45)
(sum level25 level22 level47)
(sum level26 level3 level29)
(sum level26 level5 level31)
(sum level26 level7 level33)
(sum level26 level8 level34)
(sum level26 level11 level37)
(sum level26 level19 level45)
(sum level26 level20 level46)
(sum level26 level22 level48)
(sum level27 level3 level30)
(sum level27 level5 level32)
(sum level27 level7 level34)
(sum level27 level8 level35)
(sum level27 level11 level38)
(sum level27 level19 level46)
(sum level27 level20 level47)
(sum level27 level22 level49)
(sum level28 level3 level31)
(sum level28 level5 level33)
(sum level28 level7 level35)
(sum level28 level8 level36)
(sum level28 level11 level39)
(sum level28 level19 level47)
(sum level28 level20 level48)
(sum level28 level22 level50)
(sum level29 level3 level32)
(sum level29 level5 level34)
(sum level29 level7 level36)
(sum level29 level8 level37)
(sum level29 level11 level40)
(sum level29 level19 level48)
(sum level29 level20 level49)
(sum level29 level22 level51)
(sum level30 level3 level33)
(sum level30 level5 level35)
(sum level30 level7 level37)
(sum level30 level8 level38)
(sum level30 level11 level41)
(sum level30 level19 level49)
(sum level30 level20 level50)
(sum level30 level22 level52)
(sum level31 level3 level34)
(sum level31 level5 level36)
(sum level31 level7 level38)
(sum level31 level8 level39)
(sum level31 level11 level42)
(sum level31 level19 level50)
(sum level31 level20 level51)
(sum level31 level22 level53)
(sum level32 level3 level35)
(sum level32 level5 level37)
(sum level32 level7 level39)
(sum level32 level8 level40)
(sum level32 level11 level43)
(sum level32 level19 level51)
(sum level32 level20 level52)
(sum level32 level22 level54)
(sum level33 level3 level36)
(sum level33 level5 level38)
(sum level33 level7 level40)
(sum level33 level8 level41)
(sum level33 level11 level44)
(sum level33 level19 level52)
(sum level33 level20 level53)
(sum level33 level22 level55)
(sum level34 level3 level37)
(sum level34 level5 level39)
(sum level34 level7 level41)
(sum level34 level8 level42)
(sum level34 level11 level45)
(sum level34 level19 level53)
(sum level34 level20 level54)
(sum level34 level22 level56)
(sum level35 level3 level38)
(sum level35 level5 level40)
(sum level35 level7 level42)
(sum level35 level8 level43)
(sum level35 level11 level46)
(sum level35 level19 level54)
(sum level35 level20 level55)
(sum level35 level22 level57)
(sum level36 level3 level39)
(sum level36 level5 level41)
(sum level36 level7 level43)
(sum level36 level8 level44)
(sum level36 level11 level47)
(sum level36 level19 level55)
(sum level36 level20 level56)
(sum level36 level22 level58)
(sum level37 level3 level40)
(sum level37 level5 level42)
(sum level37 level7 level44)
(sum level37 level8 level45)
(sum level37 level11 level48)
(sum level37 level19 level56)
(sum level37 level20 level57)
(sum level37 level22 level59)
(sum level38 level3 level41)
(sum level38 level5 level43)
(sum level38 level7 level45)
(sum level38 level8 level46)
(sum level38 level11 level49)
(sum level38 level19 level57)
(sum level38 level20 level58)
(sum level38 level22 level60)
(sum level39 level3 level42)
(sum level39 level5 level44)
(sum level39 level7 level46)
(sum level39 level8 level47)
(sum level39 level11 level50)
(sum level39 level19 level58)
(sum level39 level20 level59)
(sum level39 level22 level61)
(sum level40 level3 level43)
(sum level40 level5 level45)
(sum level40 level7 level47)
(sum level40 level8 level48)
(sum level40 level11 level51)
(sum level40 level19 level59)
(sum level40 level20 level60)
(sum level40 level22 level62)
(sum level41 level3 level44)
(sum level41 level5 level46)
(sum level41 level7 level48)
(sum level41 level8 level49)
(sum level41 level11 level52)
(sum level41 level19 level60)
(sum level41 level20 level61)
(sum level41 level22 level63)
(sum level42 level3 level45)
(sum level42 level5 level47)
(sum level42 level7 level49)
(sum level42 level8 level50)
(sum level42 level11 level53)
(sum level42 level19 level61)
(sum level42 level20 level62)
(sum level42 level22 level64)
(sum level43 level3 level46)
(sum level43 level5 level48)
(sum level43 level7 level50)
(sum level43 level8 level51)
(sum level43 level11 level54)
(sum level43 level19 level62)
(sum level43 level20 level63)
(sum level43 level22 level65)
(sum level44 level3 level47)
(sum level44 level5 level49)
(sum level44 level7 level51)
(sum level44 level8 level52)
(sum level44 level11 level55)
(sum level44 level19 level63)
(sum level44 level20 level64)
(sum level44 level22 level66)
(sum level45 level3 level48)
(sum level45 level5 level50)
(sum level45 level7 level52)
(sum level45 level8 level53)
(sum level45 level11 level56)
(sum level45 level19 level64)
(sum level45 level20 level65)
(sum level45 level22 level67)
(sum level46 level3 level49)
(sum level46 level5 level51)
(sum level46 level7 level53)
(sum level46 level8 level54)
(sum level46 level11 level57)
(sum level46 level19 level65)
(sum level46 level20 level66)
(sum level46 level22 level68)
(sum level47 level3 level50)
(sum level47 level5 level52)
(sum level47 level7 level54)
(sum level47 level8 level55)
(sum level47 level11 level58)
(sum level47 level19 level66)
(sum level47 level20 level67)
(sum level47 level22 level69)
(sum level48 level3 level51)
(sum level48 level5 level53)
(sum level48 level7 level55)
(sum level48 level8 level56)
(sum level48 level11 level59)
(sum level48 level19 level67)
(sum level48 level20 level68)
(sum level48 level22 level70)
(sum level49 level3 level52)
(sum level49 level5 level54)
(sum level49 level7 level56)
(sum level49 level8 level57)
(sum level49 level11 level60)
(sum level49 level19 level68)
(sum level49 level20 level69)
(sum level49 level22 level71)
(sum level50 level3 level53)
(sum level50 level5 level55)
(sum level50 level7 level57)
(sum level50 level8 level58)
(sum level50 level11 level61)
(sum level50 level19 level69)
(sum level50 level20 level70)
(sum level50 level22 level72)
(sum level51 level3 level54)
(sum level51 level5 level56)
(sum level51 level7 level58)
(sum level51 level8 level59)
(sum level51 level11 level62)
(sum level51 level19 level70)
(sum level51 level20 level71)
(sum level51 level22 level73)
(sum level52 level3 level55)
(sum level52 level5 level57)
(sum level52 level7 level59)
(sum level52 level8 level60)
(sum level52 level11 level63)
(sum level52 level19 level71)
(sum level52 level20 level72)
(sum level52 level22 level74)
(sum level53 level3 level56)
(sum level53 level5 level58)
(sum level53 level7 level60)
(sum level53 level8 level61)
(sum level53 level11 level64)
(sum level53 level19 level72)
(sum level53 level20 level73)
(sum level53 level22 level75)
(sum level54 level3 level57)
(sum level54 level5 level59)
(sum level54 level7 level61)
(sum level54 level8 level62)
(sum level54 level11 level65)
(sum level54 level19 level73)
(sum level54 level20 level74)
(sum level54 level22 level76)
(sum level55 level3 level58)
(sum level55 level5 level60)
(sum level55 level7 level62)
(sum level55 level8 level63)
(sum level55 level11 level66)
(sum level55 level19 level74)
(sum level55 level20 level75)
(sum level55 level22 level77)
(sum level56 level3 level59)
(sum level56 level5 level61)
(sum level56 level7 level63)
(sum level56 level8 level64)
(sum level56 level11 level67)
(sum level56 level19 level75)
(sum level56 level20 level76)
(sum level56 level22 level78)
(sum level57 level3 level60)
(sum level57 level5 level62)
(sum level57 level7 level64)
(sum level57 level8 level65)
(sum level57 level11 level68)
(sum level57 level19 level76)
(sum level57 level20 level77)
(sum level57 level22 level79)
(sum level58 level3 level61)
(sum level58 level5 level63)
(sum level58 level7 level65)
(sum level58 level8 level66)
(sum level58 level11 level69)
(sum level58 level19 level77)
(sum level58 level20 level78)
(sum level58 level22 level80)
(sum level59 level3 level62)
(sum level59 level5 level64)
(sum level59 level7 level66)
(sum level59 level8 level67)
(sum level59 level11 level70)
(sum level59 level19 level78)
(sum level59 level20 level79)
(sum level59 level22 level81)
(sum level60 level3 level63)
(sum level60 level5 level65)
(sum level60 level7 level67)
(sum level60 level8 level68)
(sum level60 level11 level71)
(sum level60 level19 level79)
(sum level60 level20 level80)
(sum level60 level22 level82)
(sum level61 level3 level64)
(sum level61 level5 level66)
(sum level61 level7 level68)
(sum level61 level8 level69)
(sum level61 level11 level72)
(sum level61 level19 level80)
(sum level61 level20 level81)
(sum level61 level22 level83)
(sum level62 level3 level65)
(sum level62 level5 level67)
(sum level62 level7 level69)
(sum level62 level8 level70)
(sum level62 level11 level73)
(sum level62 level19 level81)
(sum level62 level20 level82)
(sum level62 level22 level84)
(sum level63 level3 level66)
(sum level63 level5 level68)
(sum level63 level7 level70)
(sum level63 level8 level71)
(sum level63 level11 level74)
(sum level63 level19 level82)
(sum level63 level20 level83)
(sum level63 level22 level85)
(sum level64 level3 level67)
(sum level64 level5 level69)
(sum level64 level7 level71)
(sum level64 level8 level72)
(sum level64 level11 level75)
(sum level64 level19 level83)
(sum level64 level20 level84)
(sum level64 level22 level86)
(sum level65 level3 level68)
(sum level65 level5 level70)
(sum level65 level7 level72)
(sum level65 level8 level73)
(sum level65 level11 level76)
(sum level65 level19 level84)
(sum level65 level20 level85)
(sum level65 level22 level87)
(sum level66 level3 level69)
(sum level66 level5 level71)
(sum level66 level7 level73)
(sum level66 level8 level74)
(sum level66 level11 level77)
(sum level66 level19 level85)
(sum level66 level20 level86)
(sum level66 level22 level88)
(sum level67 level3 level70)
(sum level67 level5 level72)
(sum level67 level7 level74)
(sum level67 level8 level75)
(sum level67 level11 level78)
(sum level67 level19 level86)
(sum level67 level20 level87)
(sum level67 level22 level89)
(sum level68 level3 level71)
(sum level68 level5 level73)
(sum level68 level7 level75)
(sum level68 level8 level76)
(sum level68 level11 level79)
(sum level68 level19 level87)
(sum level68 level20 level88)
(sum level69 level3 level72)
(sum level69 level5 level74)
(sum level69 level7 level76)
(sum level69 level8 level77)
(sum level69 level11 level80)
(sum level69 level19 level88)
(sum level69 level20 level89)
(sum level70 level3 level73)
(sum level70 level5 level75)
(sum level70 level7 level77)
(sum level70 level8 level78)
(sum level70 level11 level81)
(sum level70 level19 level89)
(sum level71 level3 level74)
(sum level71 level5 level76)
(sum level71 level7 level78)
(sum level71 level8 level79)
(sum level71 level11 level82)
(sum level72 level3 level75)
(sum level72 level5 level77)
(sum level72 level7 level79)
(sum level72 level8 level80)
(sum level72 level11 level83)
(sum level73 level3 level76)
(sum level73 level5 level78)
(sum level73 level7 level80)
(sum level73 level8 level81)
(sum level73 level11 level84)
(sum level74 level3 level77)
(sum level74 level5 level79)
(sum level74 level7 level81)
(sum level74 level8 level82)
(sum level74 level11 level85)
(sum level75 level3 level78)
(sum level75 level5 level80)
(sum level75 level7 level82)
(sum level75 level8 level83)
(sum level75 level11 level86)
(sum level76 level3 level79)
(sum level76 level5 level81)
(sum level76 level7 level83)
(sum level76 level8 level84)
(sum level76 level11 level87)
(sum level77 level3 level80)
(sum level77 level5 level82)
(sum level77 level7 level84)
(sum level77 level8 level85)
(sum level77 level11 level88)
(sum level78 level3 level81)
(sum level78 level5 level83)
(sum level78 level7 level85)
(sum level78 level8 level86)
(sum level78 level11 level89)
(sum level79 level3 level82)
(sum level79 level5 level84)
(sum level79 level7 level86)
(sum level79 level8 level87)
(sum level80 level3 level83)
(sum level80 level5 level85)
(sum level80 level7 level87)
(sum level80 level8 level88)
(sum level81 level3 level84)
(sum level81 level5 level86)
(sum level81 level7 level88)
(sum level81 level8 level89)
(sum level82 level3 level85)
(sum level82 level5 level87)
(sum level82 level7 level89)
(sum level83 level3 level86)
(sum level83 level5 level88)
(sum level84 level3 level87)
(sum level84 level5 level89)
(sum level85 level3 level88)
(sum level86 level3 level89)

(connected l0 l1)
(fuelcost level19 l0 l1)
(connected l0 l2)
(fuelcost level8 l0 l2)
(connected l0 l4)
(fuelcost level3 l0 l4)
(connected l0 l5)
(fuelcost level11 l0 l5)
(connected l0 l6)
(fuelcost level7 l0 l6)
(connected l1 l0)
(fuelcost level19 l1 l0)
(connected l1 l5)
(fuelcost level5 l1 l5)
(connected l2 l0)
(fuelcost level8 l2 l0)
(connected l2 l3)
(fuelcost level22 l2 l3)
(connected l2 l4)
(fuelcost level7 l2 l4)
(connected l2 l5)
(fuelcost level20 l2 l5)
(connected l3 l2)
(fuelcost level22 l3 l2)
(connected l3 l5)
(fuelcost level11 l3 l5)
(connected l4 l0)
(fuelcost level3 l4 l0)
(connected l4 l2)
(fuelcost level7 l4 l2)
(connected l5 l0)
(fuelcost level11 l5 l0)
(connected l5 l1)
(fuelcost level5 l5 l1)
(connected l5 l2)
(fuelcost level20 l5 l2)
(connected l5 l3)
(fuelcost level11 l5 l3)
(connected l6 l0)
(fuelcost level7 l6 l0)

(at t0 l4)
(fuel t0 level89)
(= (total-cost) 0)

(at p0 l1)
(at p1 l1)
(at p2 l5)
(at p3 l0)
(at p4 l0)
(at p5 l0)
(at p6 l6)
)

(:goal
(and
(at p0 l2)
(at p1 l6)
(at p2 l4)
(at p3 l3)
(at p4 l1)
(at p5 l4)
(at p6 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l4 l0 level86 level3 level89)
   deleted: (at t0 l4) (fuel t0 level89)
   added: (at t0 l0) (fuel t0 level86)
   goals met: 0 of 7
2. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 0 of 7
3. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 0 of 7
4. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 0 of 7
5. (drive t0 l0 l1 level67 level19 level86)
   deleted: (at t0 l0) (fuel t0 level86)
   added: (at t0 l1) (fuel t0 level67)
   goals met: 0 of 7
6. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 1 of 7
7. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 1 of 7
8. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 1 of 7
9. (drive t0 l1 l5 level62 level5 level67)
   deleted: (at t0 l1) (fuel t0 level67)
   added: (at t0 l5) (fuel t0 level62)
   goals met: 1 of 7
10. (load p2 t0 l5)
   deleted: (at p2 l5)
   added: (in p2 t0)
   goals met: 1 of 7
11. (drive t0 l5 l3 level51 level11 level62)
   deleted: (at t0 l5) (fuel t0 level62)
   added: (at t0 l3) (fuel t0 level51)
   goals met: 1 of 7
12. (unload p3 t0 l3)
   deleted: (in p3 t0)
   added: (at p3 l3)
   goals met: 2 of 7
13. (drive t0 l3 l2 level29 level22 level51)
   deleted: (at t0 l3) (fuel t0 level51)
   added: (at t0 l2) (fuel t0 level29)
   goals met: 2 of 7
14. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 3 of 7
15. (drive t0 l2 l0 level21 level8 level29)
   deleted: (at t0 l2) (fuel t0 level29)
   added: (at t0 l0) (fuel t0 level21)
   goals met: 3 of 7
16. (drive t0 l0 l6 level14 level7 level21)
   deleted: (at t0 l0) (fuel t0 level21)
   added: (at t0 l6) (fuel t0 level14)
   goals met: 3 of 7
17. (load p6 t0 l6)
   deleted: (at p6 l6)
   added: (in p6 t0)
   goals met: 3 of 7
18. (unload p1 t0 l6)
   deleted: (in p1 t0)
   added: (at p1 l6)
   goals met: 4 of 7
19. (drive t0 l6 l0 level7 level7 level14)
   deleted: (at t0 l6) (fuel t0 level14)
   added: (at t0 l0) (fuel t0 level7)
   goals met: 4 of 7
20. (unload p6 t0 l0)
   deleted: (in p6 t0)
   added: (at p6 l0)
   goals met: 5 of 7
21. (drive t0 l0 l4 level4 level3 level7)
   deleted: (at t0 l0) (fuel t0 level7)
   added: (at t0 l4) (fuel t0 level4)
   goals met: 5 of 7
22. (unload p2 t0 l4)
   deleted: (in p2 t0)
   added: (at p2 l4)
   goals met: 6 of 7
23. (unload p5 t0 l4)
   deleted: (in p5 t0)
   added: (at p5 l4)
   goals met: 7 of 7
